<a href="https://colab.research.google.com/github/AvinashShrikhande/Python_For_DataScience/blob/main/Pandas_DataFrame_Operations_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Importing libraries**

In [3]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as pl
%matplotlib   inline

In [29]:
df= pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [30]:
df["states"]="CA NV AZ".split()
df.set_index('states', inplace=True)
df

          A    B  C
states
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

**Dropping Values from DataFrame**

In [ ]:
df.dropna(axis=0)       # By default it takes axis=0 i.e row operation

In [ ]:
df.dropna(axis=1)       # for column put axis=1

In [ ]:
df

In [ ]:
# Threshold parameter, atleast how many non NAN values present & if less than thresh then it drops it 
df.dropna(axis=0, thresh=2)

In [33]:
# can also perform on column 
df.dropna(axis=1, thresh=2)

          A  C
states
CA      1.0  1
NV      2.0  2
AZ      NaN  3

**Fill nan Values in a DataFrame**

In [34]:
df.fillna(value="Avi")

          A    B  C
states
CA        1    5  1
NV        2  Avi  2
AZ      Avi  Avi  3

In [37]:
# Trying to fillna values with a computed value (mean of column 'A' here)
df.fillna(value=df['A'].mean())

          A    B  C
states
CA      1.0  5.0  1
NV      2.0  1.5  2
AZ      1.5  1.5  3

In [41]:
data={'Company':['GOOG,','GOOG','MSFT','FB','FB','FB'],
      'Person':['sam','carl','mathew','venessa','sarah','Amy'],
      'Sales':[200,150,124,156,120,243]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0   GOOG,      sam    200
1    GOOG     carl    150
2    MSFT   mathew    124
3      FB  venessa    156
4      FB    sarah    120
5      FB      Amy    243

**Grouping some values using groupby()**

In [43]:
df.groupby('Company').mean()

         Sales
Company
FB         173
GOOG       150
GOOG,      200
MSFT       124

In [45]:
df.groupby('Company').cummin()

   Sales
0    200
1    150
2    124
3    156
4    120
5    120